{"keras_version": "1.1.0", "config": [{"config": {"trainable": true, "activity_regularizer": null, "input_dim": 14, "input_length": 3, "dropout": 0.0, "input_dtype": "int32", "name": "embedding_9", "output_dim": 64, "W_regularizer": null, "mask_zero": false, "batch_input_shape": [null, 3], "init": "uniform", "W_constraint": null}, "class_name": "Embedding"}, {"config": {"trainable": true, "forget_bias_init": "one", "input_dim": 64, "input_length": null, "dropout_W": 0.0, "dropout_U": 0.0, "inner_init": "orthogonal", "go_backwards": false, "name": "lstm_9", "activation": "tanh", "output_dim": 1024, "W_regularizer": null, "b_regularizer": null, "inner_activation": "hard_sigmoid", "return_sequences": false, "init": "glorot_uniform", "unroll": false, "stateful": false, "consume_less": "cpu", "U_regularizer": null}, "class_name": "LSTM"}, {"config": {"trainable": true, "bias": true, "activity_regularizer": null, "input_dim": null, "activation": "softmax", "b_constraint": null, "name": "dense_9", "output_dim": 14, "W_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "W_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential"}