{"config": [{"config": {"name": "embedding_2", "input_dtype": "int32", "input_length": 3, "trainable": true, "output_dim": 64, "activity_regularizer": null, "mask_zero": false, "W_constraint": null, "init": "uniform", "batch_input_shape": [null, 3], "W_regularizer": null, "dropout": 0.0, "input_dim": 14}, "class_name": "Embedding"}, {"config": {"name": "lstm_3", "consume_less": "cpu", "forget_bias_init": "one", "dropout_W": 0.0, "input_length": null, "U_regularizer": null, "inner_activation": "hard_sigmoid", "activation": "tanh", "dropout_U": 0.0, "return_sequences": true, "output_dim": 1024, "input_dim": 64, "b_regularizer": null, "stateful": false, "trainable": true, "init": "glorot_uniform", "inner_init": "orthogonal", "W_regularizer": null, "unroll": false, "go_backwards": false}, "class_name": "LSTM"}, {"config": {"name": "lstm_4", "consume_less": "cpu", "forget_bias_init": "one", "dropout_W": 0.0, "input_length": null, "U_regularizer": null, "inner_activation": "hard_sigmoid", "activation": "tanh", "dropout_U": 0.0, "return_sequences": false, "output_dim": 1024, "input_dim": 1024, "b_regularizer": null, "stateful": false, "trainable": true, "init": "glorot_uniform", "inner_init": "orthogonal", "W_regularizer": null, "unroll": false, "go_backwards": false}, "class_name": "LSTM"}, {"config": {"name": "dense_2", "output_dim": 14, "trainable": true, "init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null, "bias": true, "activation": "softmax", "b_constraint": null, "W_regularizer": null, "input_dim": null, "W_constraint": null}, "class_name": "Dense"}], "keras_version": "1.1.0", "class_name": "Sequential"}